xqjxqj/MEMS-Probe/Users/USB/USBD_STM32G4xx.c
/* -----------------------------------------------------------------------------
 * Copyright (c) 2018-2020 Arm Limited (or its affiliates). All
 * rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 *
 * $Date:        24. November 2020
 * $Revision:    V1.3
 *
 * Driver:       Driver_USBD0
 *
 * Configured:   via STM32CubeMx configuration tool
 * Project:      USB Full/Low-Speed Device Driver for
 *               STMicroelectronics STM32F3xx
 * --------------------------------------------------------------------------
 * Use the following configuration settings in the middleware component
 * to connect to this driver.
 *
 *   Configuration Setting                  Value
 *   ---------------------                  -----
 *   Connect to hardware via Driver_USBD# = 0
 * --------------------------------------------------------------------------
 * Defines used for driver configuration (at compile time):
 *   USBD_MAX_ENDPOINT_NUM: defines maximum number of IN/OUT Endpoint pairs
 *                          that driver will support with Control Endpoint 0
 *                          not included, this value impacts driver memory
 *                          requirements
 *     - default value:     2
 *     - maximum value:     7
 *
 *   USBD_EP0_RX_BUF_KIND:  Single (=0) or double (=1) buffered endpoint 0 reception
 *     - default value:     0
 *   USBD_EP0_RX_RAM_SIZE:  RAM size for reception for          endpoint 0
 *     - default value:     64
 *   USBD_EP0_TX_BUF_KIND:  Single (=0) or double (=1) buffered endpoint 0 reception
 *     - default value:     0
 *   USBD_EP0_TX_RAM_SIZE:  RAM size for transmission for       endpoint 0
 *     - default value:     64
 *
 *   USBD_EP1_RX_BUF_KIND:  Single (=0) or double (=1) buffered endpoint 1 reception
 *     - default value:     0
 *   USBD_EP1_RX_RAM_SIZE:  RAM size for reception for          endpoint 1
 *     - default value:     64
 *   USBD_EP1_TX_BUF_KIND:  Single (=0) or double (=1) buffered endpoint 1 reception
 *     - default value:     0
 *   USBD_EP1_TX_RAM_SIZE:  RAM size for transmission for       endpoint 1
 *     - default value:     64
 *
 *   USBD_EP2_RX_BUF_KIND:  Single (=0) or double (=1) buffered endpoint 2 reception
 *     - default value:     0
 *   USBD_EP2_RX_RAM_SIZE:  RAM size for reception for          endpoint 2
 *     - default value:     64
 *   USBD_EP2_TX_BUF_KIND:  Single (=0) or double (=1) buffered endpoint 2 reception
 *     - default value:     0
 *   USBD_EP2_TX_RAM_SIZE:  RAM size for transmission for       endpoint 2
 *     - default value:     64
 *
 *   USBD_EP3_RX_BUF_KIND:  Single (=0) or double (=1) buffered endpoint 3 reception
 *     - default value:     0
 *   USBD_EP3_RX_RAM_SIZE:  RAM size for reception for          endpoint 3
 *     - default value:     0
 *   USBD_EP3_TX_BUF_KIND:  Single (=0) or double (=1) buffered endpoint 3 reception
 *     - default value:     0
 *   USBD_EP3_TX_RAM_SIZE:  RAM size for transmission for       endpoint 3
 *     - default value:     0
 *
 *   USBD_EP4_RX_BUF_KIND:  Single (=0) or double (=1) buffered endpoint 4 reception
 *     - default value:     0
 *   USBD_EP4_RX_RAM_SIZE:  RAM size for reception for          endpoint 4
 *     - default value:     0
 *   USBD_EP4_TX_BUF_KIND:  Single (=0) or double (=1) buffered endpoint 4 reception
 *     - default value:     0
 *   USBD_EP4_TX_RAM_SIZE:  RAM size for transmission for       endpoint 4
 *     - default value:     0
 *
 *   USBD_EP5_RX_BUF_KIND:  Single (=0) or double (=1) buffered endpoint 5 reception
 *     - default value:     0
 *   USBD_EP5_RX_RAM_SIZE:  RAM size for reception for          endpoint 5
 *     - default value:     0
 *   USBD_EP5_TX_BUF_KIND:  Single (=0) or double (=1) buffered endpoint 5 reception
 *     - default value:     0
 *   USBD_EP5_TX_RAM_SIZE:  RAM size for transmission for       endpoint 5
 *     - default value:     0
 *
 *   USBD_EP6_RX_BUF_KIND:  Single (=0) or double (=1) buffered endpoint 6 reception
 *     - default value:     0
 *   USBD_EP6_RX_RAM_SIZE:  RAM size for reception for          endpoint 6
 *     - default value:     0
 *   USBD_EP6_TX_BUF_KIND:  Single (=0) or double (=1) buffered endpoint 6 reception
 *     - default value:     0
 *   USBD_EP6_TX_RAM_SIZE:  RAM size for transmission for       endpoint 6
 *     - default value:     0
 *
 *   USBD_EP7_RX_BUF_KIND:  Single (=0) or double (=1) buffered endpoint 7 reception
 *     - default value:     0
 *   USBD_EP7_RX_RAM_SIZE:  RAM size for reception for          endpoint 7
 *     - default value:     0
 *   USBD_EP7_TX_BUF_KIND:  Single (=0) or double (=1) buffered endpoint 7 reception
 *     - default value:     0
 *   USBD_EP7_TX_RAM_SIZE:  RAM size for transmission for       endpoint 7
 *     - default value:     0
 *
 * Notes:
 *   - HAL does not support double buffering
 * -------------------------------------------------------------------------- */

/* History:
 *  Version 1.3
 *    Removed include of stm32f3xx_hal_pcd.h header
 *  Version 1.2
 *    Updated USBD_EndpointConfigure function to check that maximum packet
 *    size requested fits into configured FIFO (compile time configured)
 *  Version 1.1
 *    Corrected transmitted count for non-control IN endpoints
 *  Version 1.0
 *    Initial release
 */

/*! \page stm32f3_usbd CMSIS-Driver USBD Setup

The CMSIS-Driver USBD requires:
  - Setup of USB clock to 48MHz
  - Configuration of USB as Device (FS)

Valid settings for various evaluation boards are listed in the table below:

