xqjxqj/MEMS-Probe/Users/USB/USBD_STM32G4xx.c
// USBD Driver functions

/**
  \fn          ARM_DRIVER_VERSION USBD_GetVersion (void)
  \brief       Get driver version.
  \return      \ref ARM_DRIVER_VERSION
*/
static ARM_DRIVER_VERSION USBD_GetVersion(void) { return usbd_driver_version; }

/**
  \fn          ARM_USBD_CAPABILITIES USBD_GetCapabilities (void)
  \brief       Get driver capabilities.
  \return      \ref ARM_USBD_CAPABILITIES
*/
static ARM_USBD_CAPABILITIES USBD_GetCapabilities(void) { return usbd_driver_capabilities; }

/**
  \fn          int32_t USBD_Initialize (ARM_USBD_SignalDeviceEvent_t   cb_device_event,
                                        ARM_USBD_SignalEndpointEvent_t cb_endpoint_event)
  \brief       Initialize USB Device Interface.
  \param[in]   cb_device_event    Pointer to \ref ARM_USBD_SignalDeviceEvent
  \param[in]   cb_endpoint_event  Pointer to \ref ARM_USBD_SignalEndpointEvent
  \return      \ref execution_status
*/
static int32_t USBD_Initialize(ARM_USBD_SignalDeviceEvent_t cb_device_event,
                               ARM_USBD_SignalEndpointEvent_t cb_endpoint_event)
{

  if (hw_initialized == true)
  {
    return ARM_DRIVER_OK;
  }

  SignalDeviceEvent = cb_device_event;
  SignalEndpointEvent = cb_endpoint_event;

  hpcd_USB_FS.Instance = USB;

  hw_initialized = true;

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_Uninitialize (void)
  \brief       De-initialize USB Device Interface.
  \return      \ref execution_status
*/
static int32_t USBD_Uninitialize(void)
{

  hpcd_USB_FS.Instance = NULL;

  hw_initialized = false;

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_PowerControl (ARM_POWER_STATE state)
  \brief       Control USB Device Interface Power.
  \param[in]   state  Power state
  \return      \ref execution_status
*/
static int32_t USBD_PowerControl(ARM_POWER_STATE state)
{

  if ((state != ARM_POWER_OFF) &&
      (state != ARM_POWER_FULL) &&
      (state != ARM_POWER_LOW))
  {
    return ARM_DRIVER_ERROR_PARAMETER;
  }

  switch (state)
  {
  case ARM_POWER_OFF:
    // Deinitialize
    HAL_PCD_DeInit(p_hpcd);

    // Clear powered flag
    hw_powered = false;
    break;

  case ARM_POWER_FULL:
    if (hw_initialized == false)
    {
      return ARM_DRIVER_ERROR;
    }
    if (hw_powered == true)
    {
      return ARM_DRIVER_OK;
    }

    // Set powered flag
    hw_powered = true;

    // Initialize
    HAL_PCD_Init(p_hpcd);
    break;

  case ARM_POWER_LOW:
    return ARM_DRIVER_ERROR_UNSUPPORTED;
  }

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_DeviceConnect (void)
  \brief       Connect USB Device.
  \return      \ref execution_status
*/
static int32_t USBD_DeviceConnect(void)
{

  if (hw_powered == false)
  {
    return ARM_DRIVER_ERROR;
  }

  HAL_PCD_Start(p_hpcd);

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_DeviceDisconnect (void)
  \brief       Disconnect USB Device.
  \return      \ref execution_status
*/
static int32_t USBD_DeviceDisconnect(void)
{

  if (hw_powered == false)
  {
    return ARM_DRIVER_ERROR;
  }

  HAL_PCD_DevDisconnect(p_hpcd);

  return ARM_DRIVER_OK;
}

/**
  \fn          ARM_USBD_STATE USBD_DeviceGetState (void)
  \brief       Get current USB Device State.
  \return      Device State \ref ARM_USBD_STATE
*/
static ARM_USBD_STATE USBD_DeviceGetState(void)
{
  return usbd_state;
}

/**
  \fn          int32_t USBD_DeviceRemoteWakeup (void)
  \brief       Trigger USB Remote Wakeup.
  \return      \ref execution_status
*/
static int32_t USBD_DeviceRemoteWakeup(void)
{

  if (hw_powered == false)
  {
    return ARM_DRIVER_ERROR;
  }

  HAL_PCD_ActivateRemoteWakeup(p_hpcd);

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_DeviceSetAddress (uint8_t dev_addr)
  \brief       Set USB Device Address.
  \param[in]   dev_addr  Device Address
  \return      \ref execution_status
*/
static int32_t USBD_DeviceSetAddress(uint8_t dev_addr)
{

  if (hw_powered == false)
  {
    return ARM_DRIVER_ERROR;
  }

  HAL_PCD_SetAddress(p_hpcd, dev_addr);

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_ReadSetupPacket (uint8_t *setup)
  \brief       Read setup packet received over Control Endpoint.
  \param[out]  setup  Pointer to buffer for setup packet
  \return      \ref execution_status
*/
static int32_t USBD_ReadSetupPacket(uint8_t *setup)
{

  if (hw_powered == false)
  {
    return ARM_DRIVER_ERROR;
  }
  if (setup_received == 0U)
  {
    return ARM_DRIVER_ERROR;
  }

  setup_received = 0U;
  memcpy(setup, setup_packet, 8);

  if (setup_received != 0U)
  { // If new setup packet was received while this was being read
    return ARM_DRIVER_ERROR;
  }

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_EndpointConfigure (uint8_t  ep_addr,
                                               uint8_t  ep_type,
                                               uint16_t ep_max_packet_size)
  \brief       Configure USB Endpoint.
  \param[in]   ep_addr  Endpoint Address
                - ep_addr.0..3: Address
                - ep_addr.7:    Direction
  \param[in]   ep_type  Endpoint Type (ARM_USB_ENDPOINT_xxx)
  \param[in]   ep_max_packet_size Endpoint Maximum Packet Size
  \return      \ref execution_status
*/
static int32_t USBD_EndpointConfigure(uint8_t ep_addr,
                                      uint8_t ep_type,
                                      uint16_t ep_max_packet_size)
{
  uint8_t ep_num;
  uint16_t ep_mps;
  volatile ENDPOINT_t *ptr_ep;

  ep_num = EP_NUM(ep_addr);
  ep_mps = ep_max_packet_size & ARM_USB_ENDPOINT_MAX_PACKET_SIZE_MASK;

  if (ep_num > USBD_MAX_ENDPOINT_NUM)
  {
    return ARM_DRIVER_ERROR_PARAMETER;
  }
  if ((ep_addr & ARM_USB_ENDPOINT_DIRECTION_MASK) == ARM_USB_ENDPOINT_DIRECTION_MASK)
  { // IN endpoint
    if (ep_mps > ep_cfg[ep_num].tx_ram_size)
    {
      return ARM_DRIVER_ERROR_PARAMETER;
    }
  }
  else
  { // OUT endpoint
    if (ep_mps > ep_cfg[ep_num].rx_ram_size)
    {
      return ARM_DRIVER_ERROR_PARAMETER;
    }
  }
  if (hw_powered == false)
  {
    return ARM_DRIVER_ERROR;
  }

