xqjxqj/MEMS-Probe/Users/USB/USBD_STM32G4xx.c
  ptr_ep = &ep[EP_ID(ep_addr)];
  if (ptr_ep->active != 0U)
  {
    return ARM_DRIVER_ERROR_BUSY;
  }

  // Clear Endpoint transfer and configuration information
  memset((void *)((uint32_t)ptr_ep), 0, sizeof(ENDPOINT_t));

  // Set maximum packet size to requested
  ptr_ep->max_packet_size = ep_mps;

  HAL_PCD_EP_Open(p_hpcd, ep_addr, ep_mps, ep_type);

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_EndpointUnconfigure (uint8_t ep_addr)
  \brief       Unconfigure USB Endpoint.
  \param[in]   ep_addr  Endpoint Address
                - ep_addr.0..3: Address
                - ep_addr.7:    Direction
  \return      \ref execution_status
*/
static int32_t USBD_EndpointUnconfigure(uint8_t ep_addr)
{
  uint8_t ep_num;
  volatile ENDPOINT_t *ptr_ep;

  ep_num = EP_NUM(ep_addr);
  if (ep_num > USBD_MAX_ENDPOINT_NUM)
  {
    return ARM_DRIVER_ERROR_PARAMETER;
  }
  if (hw_powered == false)
  {
    return ARM_DRIVER_ERROR;
  }

  ptr_ep = &ep[EP_ID(ep_addr)];
  if (ptr_ep->active != 0U)
  {
    return ARM_DRIVER_ERROR_BUSY;
  }

  // Clear Endpoint transfer and configuration information
  memset((void *)((uint32_t)ptr_ep), 0, sizeof(ENDPOINT_t));

  HAL_PCD_EP_Close(p_hpcd, ep_addr);

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_EndpointStall (uint8_t ep_addr, bool stall)
  \brief       Set/Clear Stall for USB Endpoint.
  \param[in]   ep_addr  Endpoint Address
                - ep_addr.0..3: Address
                - ep_addr.7:    Direction
  \param[in]   stall  Operation
                - \b false Clear
                - \b true Set
  \return      \ref execution_status
*/
static int32_t USBD_EndpointStall(uint8_t ep_addr, bool stall)
{
  uint8_t ep_num;

  ep_num = EP_NUM(ep_addr);
  if (ep_num > USBD_MAX_ENDPOINT_NUM)
  {
    return ARM_DRIVER_ERROR_PARAMETER;
  }
  if (hw_powered == false)
  {
    return ARM_DRIVER_ERROR;
  }

  if (stall != 0U)
  {
    // Set STALL
    HAL_PCD_EP_SetStall(p_hpcd, ep_addr);
  }
  else
  {
    // Clear STALL
    HAL_PCD_EP_ClrStall(p_hpcd, ep_addr);
  }

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_EndpointTransfer (uint8_t ep_addr, uint8_t *data, uint32_t num)
  \brief       Read data from or Write data to USB Endpoint.
  \param[in]   ep_addr  Endpoint Address
                - ep_addr.0..3: Address
                - ep_addr.7:    Direction
  \param[out]  data Pointer to buffer for data to read or with data to write
  \param[in]   num  Number of data bytes to transfer
  \return      \ref execution_status
*/
static int32_t USBD_EndpointTransfer(uint8_t ep_addr, uint8_t *data, uint32_t num)
{
  uint8_t ep_num;
  bool ep_dir;
  volatile ENDPOINT_t *ptr_ep;

  ep_num = EP_NUM(ep_addr);
  if (ep_num > USBD_MAX_ENDPOINT_NUM)
  {
    return ARM_DRIVER_ERROR_PARAMETER;
  }
  if (hw_powered == false)
  {
    return ARM_DRIVER_ERROR;
  }

  ptr_ep = &ep[EP_ID(ep_addr)];
  //  if (ptr_ep->active != 0U)
  // { return ARM_DRIVER_ERROR_BUSY; }

  ep_dir = (ep_addr & ARM_USB_ENDPOINT_DIRECTION_MASK) == ARM_USB_ENDPOINT_DIRECTION_MASK;

  ptr_ep->active = 1U;

  ptr_ep->data = data;
  ptr_ep->num = num;
  ptr_ep->num_transferred_total = 0U;
  ptr_ep->num_transferring = num;

  if ((ep_addr & 0x7F) == 0)
  {
    // Only for EP0
    if (ptr_ep->max_packet_size < num)
    {
      ptr_ep->num_transferring = ptr_ep->max_packet_size;
    }
  }

  if (ep_dir != 0U)
  {
    // IN Endpoint
    HAL_PCD_EP_Transmit(p_hpcd, ep_addr, (uint8_t *)data, ptr_ep->num_transferring);
  }
  else
  {
    // OUT Endpoint
    HAL_PCD_EP_Receive(p_hpcd, ep_addr, (uint8_t *)data, ptr_ep->num_transferring);
  }

  return ARM_DRIVER_OK;
}

/**
  \fn          uint32_t USBD_EndpointTransferGetResult (uint8_t ep_addr)
  \brief       Get result of USB Endpoint transfer.
  \param[in]   ep_addr  Endpoint Address
                - ep_addr.0..3: Address
                - ep_addr.7:    Direction
  \return      number of successfully transferred data bytes
*/
static uint32_t USBD_EndpointTransferGetResult(uint8_t ep_addr)
{
  volatile ENDPOINT_t *ptr_ep;

  ptr_ep = &ep[EP_ID(ep_addr)];
  return (ptr_ep->num_transferred_total);
}

/**
  \fn          int32_t USBD_EndpointTransferAbort (uint8_t ep_addr)
  \brief       Abort current USB Endpoint transfer.
  \param[in]   ep_addr  Endpoint Address
                - ep_addr.0..3: Address
                - ep_addr.7:    Direction
  \return      \ref execution_status
*/
static int32_t USBD_EndpointTransferAbort(uint8_t ep_addr)
{
  uint8_t ep_num;
  volatile ENDPOINT_t *ptr_ep;

  ep_num = EP_NUM(ep_addr);
  if (ep_num > USBD_MAX_ENDPOINT_NUM)
  {
    return ARM_DRIVER_ERROR_PARAMETER;
  }
  if (hw_powered == false)
  {
    return ARM_DRIVER_ERROR;
  }

  if (ep_addr & 0x80U)
  {
    PCD_SET_EP_TX_STATUS(USB, ep_num, USB_EP_TX_NAK);
    HAL_PCD_EP_Flush(p_hpcd, ep_addr);
  }
  else
  {
    PCD_SET_EP_RX_STATUS(USB, ep_num, USB_EP_RX_NAK);
  }

  ptr_ep = &ep[EP_ID(ep_addr)];
  ptr_ep->active = 0U;

  return ARM_DRIVER_OK;
}

/**
  \fn          uint16_t USBD_GetFrameNumber (void)
  \brief       Get current USB Frame Number.
  \return      Frame Number
*/
static uint16_t USBD_GetFrameNumber(void)
{

  if (hw_powered == false)
  {
    return 0U;
  }

  return ((uint16_t)(USB_FNR & USB_FNR_FN));
}

// Callbacks from HAL
/**
 * @brief  Data OUT stage callback.
 * @param  hpcd: PCD handle
 * @param  epnum: endpoint number
 * @retval None
 */
void HAL_PCD_DataOutStageCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
  uint16_t cnt;
  volatile ENDPOINT_t *ptr_ep;

  /* Prevent unused argument(s) compilation warning */
  UNUSED(hpcd);

  ptr_ep = &ep[EP_ID(epnum)];

  if (epnum != 0)
  {
    if (SignalEndpointEvent != NULL)
    {
      ptr_ep->active = 0U;
      ptr_ep->num_transferred_total = HAL_PCD_EP_GetRxCount(hpcd, epnum);
      SignalEndpointEvent(epnum, ARM_USBD_EVENT_OUT);
    }
  }
  else
  {
    cnt = HAL_PCD_EP_GetRxCount(hpcd, epnum);
    ptr_ep->num_transferred_total += cnt;
    if ((cnt < ptr_ep->max_packet_size) || (ptr_ep->num_transferred_total == ptr_ep->num))
    {
      if (SignalEndpointEvent != NULL)
      {
        ptr_ep->active = 0U;
        SignalEndpointEvent(epnum, ARM_USBD_EVENT_OUT);
      }
    }
    else
    {
      ptr_ep->num_transferring = ptr_ep->num - ptr_ep->num_transferred_total;
      if (ptr_ep->num_transferring > ptr_ep->max_packet_size)
      {
        ptr_ep->num_transferring = ptr_ep->max_packet_size;
      }
      HAL_PCD_EP_Receive(p_hpcd, epnum, (uint8_t *)(ptr_ep->data + ptr_ep->num_transferred_total), ptr_ep->num_transferring);
    }
  }
}

/**
 * @brief  Data IN stage callback.
 * @param  hpcd: PCD handle
 * @param  epnum: endpoint number
 * @retval None
 */
void HAL_PCD_DataInStageCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
  volatile ENDPOINT_t *ptr_ep;

