xqjxqj/MEMS-Probe/Users/USB/USBD_STM32G4xx.c
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hpcd);

  ptr_ep = &ep[EP_ID(epnum | 0x80)];

  ptr_ep->num_transferred_total += ptr_ep->num_transferring;
  if (epnum != 0)
  {
    if (SignalEndpointEvent != NULL)
    {
      ptr_ep->active = 0U;
      SignalEndpointEvent(epnum | ARM_USB_ENDPOINT_DIRECTION_MASK, ARM_USBD_EVENT_IN);
    }
  }
  else
  {
    // EP0
    if (ptr_ep->num_transferred_total == ptr_ep->num)
    {
      if (SignalEndpointEvent != NULL)
      {
        ptr_ep->active = 0U;
        SignalEndpointEvent(epnum | ARM_USB_ENDPOINT_DIRECTION_MASK, ARM_USBD_EVENT_IN);
      }
    }
    else
    {
      ptr_ep->num_transferring = ptr_ep->num - ptr_ep->num_transferred_total;
      if (ptr_ep->num_transferring > ptr_ep->max_packet_size)
      {
        ptr_ep->num_transferring = ptr_ep->max_packet_size;
      }
      HAL_PCD_EP_Transmit(p_hpcd, epnum | 0x80, (uint8_t *)(ptr_ep->data + ptr_ep->num_transferred_total), ptr_ep->num_transferring);
    }
  }
}
/**
 * @brief  Setup stage callback.
 * @param  hpcd: PCD handle
 * @retval None
 */
void HAL_PCD_SetupStageCallback(PCD_HandleTypeDef *hpcd)
{
  memcpy(setup_packet, hpcd->Setup, 8);
  setup_received = 1;

  // Analyze Setup packet for SetAddress
  if ((setup_packet[0] & 0xFFFFU) == 0x0500U)
  {
    USBD_DeviceSetAddress((setup_packet[0] >> 16) & 0xFFU);
  }

  if (SignalEndpointEvent != NULL)
  {
    SignalEndpointEvent(0, ARM_USBD_EVENT_SETUP);
  }
}

/**
 * @brief  USB Reset callback.
 * @param  hpcd: PCD handle
 * @retval None
 */
void HAL_PCD_ResetCallback(PCD_HandleTypeDef *hpcd)
{
  uint32_t pcd_addr;
  uint16_t n, kind, addr;

  memset((void *)((uint32_t)ep), 0, sizeof(ep));

  addr = (USBD_MAX_ENDPOINT_NUM + 1U) * 16U;
  for (n = 0U; n < (USBD_MAX_ENDPOINT_NUM + 1U); n++)
  {
    if (ep_cfg[n].tx_buf_kind == 0)
    {
      kind = PCD_SNG_BUF;
      pcd_addr = addr;
    }
    else
    {
      kind = PCD_DBL_BUF;
      pcd_addr = ((uint32_t)addr) | (((uint32_t)addr + (uint32_t)(ep_cfg[n].tx_ram_size / 2U)) << 16);
    }
    HAL_PCDEx_PMAConfig(hpcd, 0x00U | n, kind, pcd_addr);
    addr += ep_cfg[n].tx_ram_size;

    if (ep_cfg[n].rx_buf_kind == 0)
    {
      kind = PCD_SNG_BUF;
      pcd_addr = addr;
    }
    else
    {
      kind = PCD_DBL_BUF;
      pcd_addr = ((uint32_t)addr) | (((uint32_t)addr + (uint32_t)(ep_cfg[n].rx_ram_size / 2U)) << 16);
    }
    HAL_PCDEx_PMAConfig(hpcd, 0x80U | n, kind, pcd_addr);
    addr += ep_cfg[n].rx_ram_size;
  }

  if (SignalDeviceEvent != NULL)
  {
    SignalDeviceEvent(ARM_USBD_EVENT_RESET);
  }
}

/**
 * @brief  Suspend event callback.
 * @param  hpcd: PCD handle
 * @retval None
 */
void HAL_PCD_SuspendCallback(PCD_HandleTypeDef *hpcd)
{
  UNUSED(hpcd);

  if (SignalDeviceEvent != NULL)
  {
    SignalDeviceEvent(ARM_USBD_EVENT_SUSPEND);
  }
}

/**
 * @brief  Resume event callback.
 * @param  hpcd: PCD handle
 * @retval None
 */
void HAL_PCD_ResumeCallback(PCD_HandleTypeDef *hpcd)
{
  UNUSED(hpcd);

  if (SignalDeviceEvent != NULL)
  {
    SignalDeviceEvent(ARM_USBD_EVENT_RESUME);
  }
}

/**
 * @brief  Incomplete ISO OUT callback.
 * @param  hpcd: PCD handle
 * @param  epnum: endpoint number
 * @retval None
 */
void HAL_PCD_ISOOUTIncompleteCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hpcd);
  UNUSED(epnum);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_PCD_ISOOUTIncompleteCallback could be implemented in the user file
   */
}

/**
 * @brief  Incomplete ISO IN callback.
 * @param  hpcd: PCD handle
 * @param  epnum: endpoint number
 * @retval None
 */
void HAL_PCD_ISOINIncompleteCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hpcd);
  UNUSED(epnum);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_PCD_ISOINIncompleteCallback could be implemented in the user file
   */
}

/**
 * @brief  Connection event callback.
 * @param  hpcd: PCD handle
 * @retval None
 */
void HAL_PCD_ConnectCallback(PCD_HandleTypeDef *hpcd)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hpcd);

  if (SignalDeviceEvent != NULL)
  {
    SignalDeviceEvent(ARM_USBD_EVENT_VBUS_ON);
  }
}

/**
 * @brief  Disconnection event callback.
 * @param  hpcd: PCD handle
 * @retval None
 */
void HAL_PCD_DisconnectCallback(PCD_HandleTypeDef *hpcd)
{
  UNUSED(hpcd);

  if (SignalDeviceEvent != NULL)
  {
    SignalDeviceEvent(ARM_USBD_EVENT_VBUS_OFF);
  }
}

// Exported driver structure
ARM_DRIVER_USBD Driver_USBD0 = {
    USBD_GetVersion,
    USBD_GetCapabilities,
    USBD_Initialize,
    USBD_Uninitialize,
    USBD_PowerControl,
    USBD_DeviceConnect,
    USBD_DeviceDisconnect,
    USBD_DeviceGetState,
    USBD_DeviceRemoteWakeup,
    USBD_DeviceSetAddress,
    USBD_ReadSetupPacket,
    USBD_EndpointConfigure,
    USBD_EndpointUnconfigure,
    USBD_EndpointStall,
    USBD_EndpointTransfer,
    USBD_EndpointTransferGetResult,
    USBD_EndpointTransferAbort,
    USBD_GetFrameNumber};

/*! \endcond */
